const questions = [

{
question:"سؤال ۱ : بیستمین عدد زوج کدام است؟",
options:["20","40","22","38"],
answer:1
},

{
question:"سؤال ۲ : بیست و هفتمین عدد فرد کدام است؟",
options:["53","55","51","57"],
answer:0
},

{
question:"سؤال ۳ : عدد 128 چندمین عدد زوج است؟",
options:["32","64","128","256"],
answer:1
},

{
question:"سؤال ۴ : عدد 99 چندمین عدد فرد است؟",
options:["48","49","50","51"],
answer:2
},

{
question:"سؤال ۵ : کدام عدد زوج است؟",
options:["45","53","78","91"],
answer:2
},

{
question:"سؤال ۶ : کدام عدد فرد است؟",
options:["82","64","96","79"],
answer:3
},

{
question:"سؤال ۷ : اگر 2 را به یک عدد زوج اضافه کنیم، حاصل ...",
options:[
"فرد می‌شود",
"زوج می‌ماند",
"صفر می‌شود",
"مشخص نیست"
],
answer:1
},

{
question:"سؤال ۸ : اگر 1 را به یک عدد زوج اضافه کنیم، حاصل ...",
options:[
"زوج است",
"فرد است",
"صفر است",
"مشخص نیست"
],
answer:1
},

{
question:"سؤال ۹ : اگر 1 را از یک عدد فرد کم کنیم، حاصل ...",
options:[
"فرد است",
"زوج است",
"صفر است",
"مشخص نیست"
],
answer:1
},

{
question:"سؤال ۱۰ : اگر 2 را از یک عدد فرد کم کنیم، حاصل ...",
options:[
"فرد است",
"زوج است",
"صفر است",
"مشخص نیست"
],
answer:0
},
{
question:"سؤال ۱۱ : بین عددهای 1 تا 20 چند عدد زوج وجود دارد؟",
options:["9","10","11","12"],
answer:1
},

{
question:"سؤال ۱۲ : بین عددهای 1 تا 30 چند عدد فرد وجود دارد؟",
options:["14","15","16","17"],
answer:1
},

{
question:"سؤال ۱۳ : اگر سه عدد زوجِ پشت سر هم را با هم جمع کنیم، حاصل همیشه ...",
options:[
"زوج است",
"فرد است",
"گاهی زوج و گاهی فرد",
"مشخص نیست"
],
answer:0
},

{
question:"سؤال ۱۴ : اگر سه عدد فردِ پشت سر هم را با هم جمع کنیم، حاصل همیشه ...",
options:[
"زوج است",
"فرد است",
"گاهی زوج و گاهی فرد",
"مشخص نیست"
],
answer:1
},

{
question:"سؤال ۱۵ : بزرگ‌ترین عدد زوج دو رقمی کدام است؟",
options:["97","98","99","100"],
answer:1
},

{
question:"سؤال ۱۶ : مجموع دو عدد زوج همیشه ...",
options:[
"زوج است",
"فرد است",
"گاهی زوج و گاهی فرد",
"مشخص نیست"
],
answer:0
},

{
question:"سؤال ۱۷ : مجموع دو عدد فرد همیشه ...",
options:[
"زوج است",
"فرد است",
"گاهی زوج و گاهی فرد",
"مشخص نیست"
],
answer:0
},

{
question:"سؤال ۱۸ : مجموع یک عدد زوج و یک عدد فرد همیشه ...",
options:[
"زوج است",
"فرد است",
"صفر می‌شود",
"مشخص نیست"
],
answer:1
},

{
question:"سؤال ۱۹ : کوچک‌ترین عدد فرد سه رقمی کدام است؟",
options:["99","100","101","103"],
answer:2
},

{
question:"سؤال ۲۰ : کدام گزینه درست است؟",
options:[
"هر عددی که بر 2 بخش‌پذیر باشد زوج است.",
"هر عدد زوج بر 3 بخش‌پذیر است.",
"همه عددهای فرد از 5 بزرگ‌ترند.",
"عدد صفر فرد است."
],
answer:0
}

];
